% 数字黑洞 6174
% 任意选一个四位数（数字不能全相同），把所有数字从大到小排列，再把所有数字从小到大排列，用前者减去后者得到一个新的数。重复对新得到的数进行上述操作，7 步以内必然会得到 6174。
% 
% 例如，选择四位数 6767：
% 
% 7766 - 6677 = 1089
% 9810 - 0189 = 9621
% 9621 - 1269 = 8352
% 8532 - 2358 = 6174
% 7641 - 1467 = 6174
% ……
% 6174 这个“黑洞”就叫做 Kaprekar 常数。对于三位数，也有一个数字黑洞——495。
%WHY???
% a(1,:) = randperm(9);%%没有“0”
% aa(1,:) = a(1,1:4);
% for m = 1:10
%     b1(m,:) = sort(aa(m,:),'descend');
%     c1(m) = b1(m,1)*1000 + b1(m,2)*100 + b1(m,3)*10 + b1(m,4);
%     b2(m,:) = sort(aa(m,:));
%     c2(m) = b2(m,1)*1000 + b2(m,2)*100 + b2(m,3)*10 + b2(m,4);
%     cc(m) = c1(m)-c2(m);
%     aa(m+1,1) = fix(cc(m)/1000);
%     aa(m+1,2) = fix((cc(m)-aa(m+1,1)*1000)/100);
%     aa(m+1,3) = fix((cc(m)-aa(m+1,1)*1000-aa(m+1,2)*100)/10);
%     aa(m+1,4) = cc(m)-aa(m+1,1)*1000-aa(m+1,2)*100-aa(m+1,3)*10;
% end

% 3x + 1 问题
% 从任意一个正整数开始，重复对其进行下面的操作：如果这个数是偶数，把它除以 2 ；如果这个数是奇数，则把它扩大到原来的 3 倍后再加 1 。你会发现，序列最终总会变成 4, 2, 1, 4, 2, 1, … 的循环。
x (1)= fix(rand*1000);
for m = 1:100
    if(rem(x(m),2) == 0)
       x(m+1) = x(m)/2;
    elseif(rem(x(m),2) == 1)
       x(m+1) = 3*x(m) + 1;
    end
end


    
        
